anthropic.claude-code
christian-kohler.path-intellisense
davidanson.vscode-markdownlint
donjayamanne.githistory
dutchigor.json-viewer
eamodio.gitlens
hediet.vscode-drawio
ibm.output-colorizer
imgildev.vscode-json-flow
james-yu.latex-workshop
jeff-hykin.better-cpp-syntax
marimo-team.vscode-marimo
mathematic.vscode-pdf
mechatroner.rainbow-csv
MermaidChart.vscode-mermaid-chart
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
Ollama.ollama
pkief.material-icon-theme
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
tamasfe.even-better-toml
thinker.sort-json
vscode-icons-team.vscode-icons
yzhang.markdown-all-in-one
zhoufeng.json-helper